{"data":{"post":{"id":"8eb0f9c0-298e-57e5-ae7d-026ef6f54176","html":"<p>The Institute for the Application of Learning Science and Educational Technology (ALSET) is pleased to announce the release of its 2018 Annual Report. <a href=\"https://blog.nus.edu.sg/alsetnus/files/2019/01/2018-ALSET-Annual-Report-2auzh51.pdf\">Click here to download</a></p>\n<p>Founded with the mission to build a community of researchers and educators at NUS with a shared passion for educational research and innovation, ALSET achieved many milestones this year.</p>\n<h3>Highlights of 2018.</h3>\n<ul>\n<li>Community: we tripled the size of our research community, which now includes over 60 members from more than 15 unique disciplines, making us one of the most multidisciplinary institutes focused on the learning sciences and educational technology.</li>\n<li>Research: we launched exciting studies to investigate learning policies and practices in Singapore and around the world, with ongoing research projects covering topics as varied as the impact of sleep on learning; how social networks make you smarter (or dumber); and the undergraduate behaviours that not only help students to land a job, but also to build a successful career and a meaningful life.</li>\n<li>Courses: we ran courses and competitions that reached thousands of Singaporeans, including Learning to Learn Better and Learning to Choose Better, two new courses that help to cultivate essential skills in effective learning and decisions making.</li>\n<li>Data: we bolstered the ALSET Educational Data Lake, a powerful resource that now includes anonymised data on over 120,000 NUS students and alumni, and which will help establish NUS as a global hub for educational research.</li>\n</ul>","fields":{"slug":"/ALSET-releases-AR2018/","prefix":"2019-01-22"},"frontmatter":{"title":"Alset releases 2018 Annual Report","author":"NUS ALSET","category":"Highlights","cover":{"childImageSharp":{"resize":{"src":"/alset/public/static/ba21434d141c4c191dec227753ba9fa2/ada8c/alset_cover.jpg"}}}}},"authornote":{"id":"5fd44ddb-46e7-5c75-a4c9-cac294988209","html":"<p>An institute at the National University of Singapore, <strong>ALSET</strong> supports research and innovation in learning science, technology, and pedagogy.</p>\n<p>We conduct original studies, promote innovative projects, and work to ensure the latest research and learning technologies have a broad impact.</p>"},"site":{"siteMetadata":{"facebook":{"appId":""}}}},"pageContext":{"slug":"/ALSET-releases-AR2018/","prev":{"id":"e115932c-25df-522f-8d77-7536ac1e5070","fields":{"slug":"/Alset-partners-SkillsFutureSingapore/","prefix":"2018-10-24","source":"posts"},"frontmatter":{"title":"Alset partners with SkillsFuture Singapore to leverage AI for Career Guidance","category":"Highlights"}},"source":"posts"}}