{"data":{"post":{"id":"baea3949-40b2-50a3-8cd4-03d3dbe09384","html":"<p>As we enter the second half of the semester at NUS, we’d like to share a few updates on our progress and forthcoming initiatives at ALSET.</p>\n<p>First, we recently welcomed Ranga Krishnan (Dean of Rush Medical College in Chicago) and Trevor Robbins (Professor of Cognitive Neuroscience and Experimental Psychology at Cambridge University) to NUS for our annual advisory board meeting in September. As always, they provided helpful feedback for our Research Theme Leaders, as well as ALSET Core Faculty member Paul O’Keefe, who joined the meeting to present his exciting new work on motivational mindsets and the cultivation of interests (check out recent coverage in <a href=\"https://hbr.org/2018/09/having-a-growth-mindset-makes-it-easier-to-develop-new-interests\">HBR</a> and <a href=\"https://www.theatlantic.com/science/archive/2018/07/find-your-passion-is-terrible-advice/564932/\">The Atlantic</a> for more info).</p>\n<p>As some of you may remember, Ranga’s <a href=\"https://www.duke-nus.edu.sg/tags/dean-ranga-krishnan\">writings on the science of learning</a> during his time as Dean of Duke-NUS Medical School were a major inspiration for the founding of ALSET. While he moved to the United States in 2015, he will be returning to Singapore again as the guest of honor for the Inaugural Science of Learning Symposium on Nov 2. It should be a great day of discussion, so we encourage you to join if you are available.</p>\n<p>Part of our work at ALSET involves creating and delivering courses that help learners to learn better. One recent effort from our Educational Unit was the launch of ALS1020 (Learning to Choose), a new course on the fundamentals of decision making and cognitive bias. We are pleased to report that we attracted 92 students for the first round of enrollment, and look forward to extending our reach in 2019.</p>\n<p>ALSET courses not only provide meaningful learning experiences to students—they also serve as a lab for our researchers to investigate learning behaviors and test pedagogical interventions. One of those researchers is Joshua Gooley, who is currently using wearable sleep sensors to conduct research on student sleep habits in Learning to Learn Better, our flagship course on learning science. We welcome other researchers to partner with us for studies like this.</p>\n<p>In other research news, our Discovery Research Unit added 12 new researchers and 3 new research assistants to our team this semester. We also saw growth in the new Special Interest Group for Translational Classroom Research headed by Laksh Samavedham, who will be driving initiatives to improve our education programs using insights from the ALSET Educational Data Lake. They will benefit from our growing data assets, which are being managed by Chris Boesch and Kevin Hartman at our Translational Research Unit.</p>\n<p>We also <a href=\"http://blog.nus.edu.sg/alsetnus/2018/10/08/alset-opens-registration-ace-of-coders-2018/\">opened registration for Ace of Coders 2018</a>, an annual ALSET-led coding event open to all secondary, junior college, and polytechnic students in Singapore. As in previous years, we expect to attract over 1000 students. It follows on a recent series of ALSET workshops for young females with an interest in learning to code. A major goal for these events is to better understand the barriers for entry and increase diversity in the STEM disciplines.</p>\n<p>We are still open to recruiting more faculty from across the university to join our growing research community, as well as external collaborators from near and far. If anyone you know is interested, please contact our Discovery Research Coordinator Alex Biotteau for details on the benefits and levels of membership available. For further information, you can also visit the ALSET Website or reach out to any of us directly.</p>","fields":{"slug":"/alset-Midsemester-Update/","prefix":"2018-10-11"},"frontmatter":{"title":"Alset Mid-semester Update","author":"NUS ALSET","category":"Highlights","cover":{"childImageSharp":{"resize":{"src":"/alset/public/static/f4e9701e769a62fde7144b6aee74296c/ada8c/alsetMidsemUpdate.jpg"}}}}},"authornote":{"id":"5fd44ddb-46e7-5c75-a4c9-cac294988209","html":"<p>An institute at the National University of Singapore, <strong>ALSET</strong> supports research and innovation in learning science, technology, and pedagogy.</p>\n<p>We conduct original studies, promote innovative projects, and work to ensure the latest research and learning technologies have a broad impact.</p>"},"site":{"siteMetadata":{"facebook":{"appId":""}}}},"pageContext":{"slug":"/alset-Midsemester-Update/","next":{"id":"e115932c-25df-522f-8d77-7536ac1e5070","fields":{"slug":"/Alset-partners-SkillsFutureSingapore/","prefix":"2018-10-24","source":"posts"},"frontmatter":{"title":"Alset partners with SkillsFuture Singapore to leverage AI for Career Guidance","category":"Highlights"}},"source":"posts"}}