{"data":{"post":{"id":"e115932c-25df-522f-8d77-7536ac1e5070","html":"<p>On October 24, the Institute for Application of Learning Science and Educational Technology (ALSET) at the National University of Singapore concluded a grant agreement with the Workforce Development Applied Research Fund (WDARF) at SkillsFuture Singapore to develop AI-based tools that support course selection and career planning.</p>\n<p>The grant will fund a pilot study to prototype an AI-driven recommender system that helps working adults in Singapore to identify courses that support continuing education goals. The study is intended as the initial phase of a long-term initiative by ALSET to research lifelong learning behaviours and policies in Asia.</p>\n<p>“This grant represents an exciting step in a broader journey to explore the power of new technologies to support lifelong learning and workforce resilience,” said Prof Robert Kamei, Director of ALSET and co-PI on the grant. “We see vast potential for technology to help working adults to navigate an increasingly competitive and complex job market, but we need to rigorously test and evaluate these technologies to ensure they achieve meaningful impact for workers of all backgrounds, not just those who already possess high-demand skills.”</p>\n<p>The pilot study was unofficially launched in June and began with an analysis of SSG’s SkillsFuture Credit (SFC) Programme, which offers direct subsidies of S$500 to all Singapore citizens over the age of 25 for a pre-approved list of courses (and even higher subsidies for mid-career professionals). About 285,000 Singaporeans have used these credits since the programme was launched in 2016, providing a rich trove of anonymised data for understanding course selection behaviours.</p>\n<p>From this analysis, ALSET is developing a recommender system that uses data on SFC credit claims and other various parameters, such as demographic and behavioural information, to recommend courses from the SFC catalogue. The system will be embedded in a mobile application under development by CXS International, a learning analytics company with a focus on preparing national workforces.</p>\n<p>The system will be tested on a cohort of NUS alumni between the ages of 22-29 starting in the fourth quarter of 2018, with final results expected in mid-2019. ALSET intends to use the findings to inform subsequent phases of research that involve the adaptation of this recommender system to other contexts, as well as broader research on the various factors that drive lifelong learning.</p>\n<p>“Recent advances in AI are well suited to the challenges of course recommendation and career guidance,” said Prof Min-Yen Kan, an Associate Professor at the NUS School of Computing, Deputy Director of ALSET’s Discovery Research Unit, and co-PI on the grant. “Using methodologies like collaborative filtering and natural language analysis, we are optimistic that our research will support the creation of impactful technologies.”</p>\n<p>These efforts dovetail with similar projects underway at NUS. The NUS School of Computing, for example, recently partnered with JobTech, a Singapore-based startup that provides data-driven job matching and labour market intelligence services, to develop NUS Career+, an AI-driven mobile app that advises students on education planning and career selection. Funded through AI Singapore’s 100 Experiments Programme, we expect this project will produce insights and technologies that complement ALSET’s research.</p>\n<p>As governments and educational institutions around the world increasingly understand the importance of lifelong learning for workforce resilience, ALSET looks forward to forging partnerships that produce new educational technologies and evaluate their impact. Please contact us if you are interested in learning more about our work in this field.</p>","fields":{"slug":"/Alset-partners-SkillsFutureSingapore/","prefix":"2018-10-24"},"frontmatter":{"title":"Alset partners with SkillsFuture Singapore to leverage AI for Career Guidance","author":"NUS ALSET","category":"Highlights","cover":{"childImageSharp":{"resize":{"src":"/alset/public/static/e1a8ad6e1fff4dbba2d5d58a5403d573/ada8c/AlsetpartnerSkillsfuture.jpg"}}}}},"authornote":{"id":"5fd44ddb-46e7-5c75-a4c9-cac294988209","html":"<p>An institute at the National University of Singapore, <strong>ALSET</strong> supports research and innovation in learning science, technology, and pedagogy.</p>\n<p>We conduct original studies, promote innovative projects, and work to ensure the latest research and learning technologies have a broad impact.</p>"},"site":{"siteMetadata":{"facebook":{"appId":""}}}},"pageContext":{"slug":"/Alset-partners-SkillsFutureSingapore/","prev":{"id":"baea3949-40b2-50a3-8cd4-03d3dbe09384","fields":{"slug":"/alset-Midsemester-Update/","prefix":"2018-10-11","source":"posts"},"frontmatter":{"title":"Alset Mid-semester Update","category":"Highlights"}},"next":{"id":"8eb0f9c0-298e-57e5-ae7d-026ef6f54176","fields":{"slug":"/ALSET-releases-AR2018/","prefix":"2019-01-22","source":"posts"},"frontmatter":{"title":"Alset releases 2018 Annual Report","category":"Highlights"}},"source":"posts"}}